Revit 2027 API
ContinuousRailType.StartOrBottomExtensionLength Property
 The extension length of the rail termination at the beginning or bottom.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StartOrBottomExtensionLength { get; set; }
Public Property StartOrBottomExtensionLength As Double
	Get
	Set
public:
property double StartOrBottomExtensionLength {
	double get ();
	void set (double value);
}
member StartOrBottomExtensionLength : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for startExtensionLength must be between 0 and 30000 feet.
See Also
Reference
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace